app/Controllers/Admin/Peminjaman.php

SELECT `tbl_peminjaman`.*, `tbl_buku`.`judul_buku`, `tbl_buku`.`cover`, `tbl_anggota`.`nama_anggota`, `tbl_anggota`.`nim`
FROM `tbl_peminjaman`
JOIN `tbl_buku` ON `tbl_buku`.`id_buku` = `tbl_peminjaman`.`id_buku`
JOIN `tbl_anggota` ON `tbl_anggota`.`id_anggota` = `tbl_peminjaman`.`id_anggota`
WHERE `tbl_peminjaman`.`status` = 'pengajuan'
ORDER BY `tbl_peminjaman`.`id_anggota` ASC, `tbl_peminjaman`.`id_peminjaman` DESC
---
    public function index()
    {
        $db = \Config\Database::connect();

        // Get all pending peminjaman ordered by anggota
        $peminjamanList = $db->table('tbl_peminjaman')
                            ->select('tbl_peminjaman.*, tbl_buku.judul_buku, tbl_buku.cover, tbl_anggota.nama_anggota, tbl_anggota.nim')
                            ->join('tbl_buku', 'tbl_buku.id_buku = tbl_peminjaman.id_buku')
                            ->join('tbl_anggota', 'tbl_anggota.id_anggota = tbl_peminjaman.id_anggota')
                            ->where('tbl_peminjaman.status', 'pengajuan')
                            ->orderBy('tbl_peminjaman.id_anggota', 'ASC')
                            ->orderBy('tbl_peminjaman.id_peminjaman', 'DESC')
                            ->get()->getResultArray();