app/Controllers/Anggota.php

    public function Daftar()
    {
        $data = [
            'judul' => 'Daftar Anggota',
            'page'  => 'v_daftar_anggota',
            'kelas' => $this->ModelKelas->findAll(),
---
SELECT *
FROM `tbl_kelas`

    public function edit ($id_anggota) {
        $data = [
            'judul' => 'Edit Anggota',
            'menu' => 'user',
            'page' => 'dashboard_anggota/v_edit_profil',
            'anggota' => $this->ModelAnggota->find($id_anggota),
            'kelas' => $this->ModelKelas->findAll(),
        ];
---
SELECT *
FROM `tbl_kelas`
SELECT *
FROM `tbl_anggota`
WHERE `tbl_anggota`.`id_anggota` = '9'

     public function updateData($id_anggota)
    {
        $validation = \Config\Services::validation();

        // Ambil data lama
        $anggota = $this->ModelAnggota->find($id_anggota);
---
SELECT *
FROM `tbl_anggota`
WHERE `tbl_anggota`.`id_anggota` = '4'

    public function verify($id_anggota)
    {
        $anggota = $this->ModelAnggota->find($id_anggota);
        if (! $anggota) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Data anggota tidak ditemukan');
        }

        // Set verifikasi = 1
        $this->ModelAnggota->update($id_anggota, ['verifikasi' => 1]);
---
SELECT *
FROM `tbl_anggota`
WHERE `tbl_anggota`.`id_anggota` = '4'
UPDATE `tbl_anggota` SET `verifikasi` = 1
WHERE `tbl_anggota`.`id_anggota` IN ('4')