app/Controllers/Anggota.php

    public function Daftar()
    {
        $data = [
            'judul' => 'Daftar Anggota',
            'page'  => 'v_daftar_anggota',
            'kelas' => $this->ModelKelas->findAll(),
        ];
---
SELECT *
FROM `tbl_kelas`

    public function DaftarAnggota()
    {
        $validation = \Config\Services::validation();


        $data = [
            'nim'          => $this->request->getPost('nim'),
            'nama_anggota' => $this->request->getPost('nama_anggota'),
            'password'     => $this->request->getPost('password'),
            'jenis_kelamin'=> $this->request->getPost('jenis_kelamin'),
            'id_kelas'     => $this->request->getPost('kelas'),
            'no_hp'        => $this->request->getPost('no_hp'),
            'alamat'       => $this->request->getPost('alamat'),
        ];

        if (!$this->ModelAnggota->insert($data)) {
---
INSERT INTO `tbl_anggota` (`nim`, `nama_anggota`, `password`, `jenis_kelamin`, `id_kelas`, `no_hp`, `alamat`) VALUES ('42423049', 'Muhammad Isa Irawanto', '$2y$10$LDXden8kuSVkYs36msTJOu.G/pyZYtPlxLQn8qUowrGXpHf1UjlHi', 'Laki-Laki', '1', '082329221051', 'grengseng 04 10 tarabana')