app/Controllers/Feedback.php

SELECT *
FROM `tbl_feedback`
---
    public function index()
    {
        $data = [
            'judul' => 'Feedback',
            'menu' => 'feedback',
            'submenu' => 'feedback',
            'page'  => 'feedback/v_index',
            'feedback' => $this->ModelFeedback->findAll()