app/Controllers/Home.php

SELECT *
FROM `tbl_slider`
---
    public function index(): string
    {
        $data = [
            'judul' => 'Home',
            'page' => 'v_home',
            'slider' => $this->ModelSlider->findAll(),
        ];