app/Controllers/Kategori.php

    public function index()
    {
        $data = [
            'menu' => 'masterdata',
            'submenu' => 'kategori',
            'judul' => 'Kategori',
            'page'  => 'kategori/v_index',
            'kategori' => $this->ModelKategori->findAll()
---
SELECT *
FROM `tbl_kategori`