app/Controllers/Pengaturan.php

SELECT *
FROM `tbl_slider`
---
    public function slider()
    {
        $data = [
            'menu' => 'pengaturan',
            'submenu'=> 'slider',
            'judul' => 'Slider',
            'page'  => 'slider/v_slider',
            'slider'   => $this->ModelSlider->findAll(),