app/Controllers/Rak.php

    public function index()
    {
        $data = [
            'judul' => 'Rak',
            'menu' => 'masterdata',
            'submenu' => 'rak',
            'page'  => 'rak/v_index',
            'rak' => $this->ModelRak->findAll()
---
SELECT *
FROM `tbl_rak`