app/Controllers/User.php

    public function index()
    {
        $data = [
            'judul' => 'User',
            'menu' => 'user',
            'page' => 'user/v_index',
            'users' => $this->ModelUser->findAll(),
---
SELECT *
FROM `tbl_user`

        ];

        // SIMPAN KE DATABASE (TANPA MOVE FOTO)
        if (!$this->ModelUser->insert($data)) {
---
INSERT INTO `tbl_user` (`nama_user`, `email`, `password`, `role`, `foto`) VALUES ('zaydan', 'zaydan@gmail.com', '$2y$10$2wiVU/d9mlbIKZSak0fYSeE51qV1AZi0aeMjImUYRKL0HmJweusNO', 'user', '1768007438_ae47c43d922141aa2cd3.jpg')