app/Models/ModelAuth.php

SELECT *
FROM `tbl_user`
WHERE `email` = 'admin@gmail.com'
---
    public function LoginUser($email, $password)
    {
        // Ambil user berdasarkan email
        $db = \Config\Database::connect();
        $user = $db->table('tbl_user')
            ->where('email', $email)
            ->get()
            ->getRowArray();

SELECT *
FROM `tbl_anggota`
WHERE `nim` = '42423049'
---
    public function LoginAnggota($nim, $password)
    {
        // Ambil anggota berdasarkan nim
        $db = \Config\Database::connect();
        $anggota = $db->table('tbl_anggota')
            ->where('nim', $nim)
            ->get()
            ->getRowArray();