app/Models/ModelEbook.php

SELECT *
FROM `tbl_ebook`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori` = `tbl_ebook`.`id_kategori`
JOIN `tbl_penulis` ON `tbl_penulis`.`id_penulis` = `tbl_ebook`.`id_penulis`
JOIN `tbl_penerbit` ON `tbl_penerbit`.`id_penerbit` = `tbl_ebook`.`id_penerbit`
ORDER BY `tbl_ebook`.`id_ebook` DESC
 LIMIT 10
---
    public function EbookBaru()
    {
        return $this->db->table('tbl_ebook')
                ->join('tbl_kategori', 'tbl_kategori.id_kategori = tbl_ebook.id_kategori')
                    ->join('tbl_penulis', 'tbl_penulis.id_penulis = tbl_ebook.id_penulis')
                    ->join('tbl_penerbit', 'tbl_penerbit.id_penerbit = tbl_ebook.id_penerbit')
                    ->orderBy('tbl_ebook.id_ebook', 'DESC')
                    ->limit(10)
                    ->get()->getResultArray();