app/Models/ModelAdmin.php

SELECT COUNT(*) AS `numrows`
FROM `tbl_user`
---
    public function TotalUser()
    {
        return $this->db->table('tbl_user')
            ->countAllResults();