app/Models/ModelBuku.php

    public function BukuBaru()
    {
        return $this->db->table('tbl_buku')
                ->join('tbl_kategori', 'tbl_kategori.id_kategori = tbl_buku.id_kategori')
                    ->join('tbl_rak', 'tbl_rak.id_rak = tbl_buku.id_rak')
                    ->join('tbl_penulis', 'tbl_penulis.id_penulis = tbl_buku.id_penulis')
                    ->join('tbl_penerbit', 'tbl_penerbit.id_penerbit = tbl_buku.id_penerbit')
                    ->orderBy('tbl_buku.id_buku', 'DESC')
                    ->limit(10)
                    ->get()->getResultArray();
---
SELECT *
FROM `tbl_buku`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori` = `tbl_buku`.`id_kategori`
JOIN `tbl_rak` ON `tbl_rak`.`id_rak` = `tbl_buku`.`id_rak`
JOIN `tbl_penulis` ON `tbl_penulis`.`id_penulis` = `tbl_buku`.`id_penulis`
JOIN `tbl_penerbit` ON `tbl_penerbit`.`id_penerbit` = `tbl_buku`.`id_penerbit`
ORDER BY `tbl_buku`.`id_buku` DESC
 LIMIT 10